app/controllers/bg_tests_controller.rb

SELECT "bg_tests".* FROM "bg_tests" WHERE "bg_tests"."user_id" = 4
---
  def index
    @bg_tests = BgTest.where(user_id: @current_user)