app/controllers/bg_tests_controller.rb

SELECT "bg_tests".* FROM "bg_tests"
---
  def index
    @bg_tests = BgTest.all

INSERT INTO "bg_tests" ("bg_result", "date", "time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bg_result", 3.2], ["date", Thu, 23 Feb 2017], ["time", 2017-02-23 00:48:18 UTC], ["user_id", 1], ["created_at", 2017-02-23 00:48:18 UTC], ["updated_at", 2017-02-23 00:48:18 UTC]]
---
  def create
    @bg_test = BgTest.new(bg_test_params)

    if @bg_test.save

DELETE FROM "bg_tests" WHERE "bg_tests"."id" = $1  [["id", 1]]
---
  def destroy
    @bg_test.destroy

SELECT  "bg_tests".* FROM "bg_tests" WHERE "bg_tests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_bg_test
      @bg_test = BgTest.find(params[:id])