app/controllers/medications_controller.rb

SELECT  "medications".* FROM "medications" ORDER BY "medications"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @medications = Medication.all