app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(@current_user)

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Bitch"], ["last_name", "Catwoman"], ["updated_at", 2017-02-22 13:31:31 UTC], ["id", 2]]
SELECT "medications".* FROM "medications" INNER JOIN "medications_users" ON "medications"."id" = "medications_users"."medication_id" WHERE "medications_users"."user_id" = $1  [["user_id", 2]]
---
  def update
      if @user.update(user_params)
        if params[:medication_id]
          @user.medications << Medication.find(params[:medication_id])

SELECT "bg_tests".* FROM "bg_tests" WHERE "bg_tests"."user_id" = $1  [["user_id", 2]]
DELETE FROM "bg_tests" WHERE "bg_tests"."id" = $1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    @bg_test = BgTest.where(user_id: @current_user)
    # Deletes all Bgs belonging to User
    @bg_test.destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(@current_user)